/* Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….). */
    for (let i=20; i<=30; i+=0.5) {
        console.log(i);
    }
    
    
/* Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів. */
    const dol = 27;
    
    for(let i=10; i<=100; i+=10) {
        console.log(`${i} USA = ${i*dol} UAH`)
    }
    
    
 /* Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N. */
    const n = +prompt("Введіть будь яке число: "); // 
    
    for (let i = 1; i <= 100; i++) {
      if (i * i <= n) {
       console.log(`${i} * ${i} = ${i*i}`);
      } 
    }
    
    
    
    
 /* Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе). 
    
    
 В цьому коді змінна number містить задане число. У тілі коду спочатку перевіряється, чи є число менше або дорівнює 1. Якщо це так, то воно не є простим числом. Якщо число більше 1, то запускається цикл for, який перебирає всі числа від 2 до кореня квадратного з числа. Якщо число ділиться на будь-яке з цих чисел без залишку, то воно не є простим числом і змінна verif стає рівною false. Якщо число пройшло всі перевірки і змінна verif залишається рівною true, то виводиться алерт, що число є простим, інакше виводиться алерт, що число не є простим.
    
 */
    
    const number = +prompt("Введіть будь яке число: "); 
    
    // Перевірка чи є задане число простим
    let verif = true;
    
    if(number<=1) {
        verif = false;
    } else {
        for (let i=2; i<=Math.sqrt(number); i++) {
            if(number % i === 0){
                verif = false;
                break;
            }
        }
    }
    
    // Виведення результату перевірки на алерт
    if (verif) {
      alert(`Число ${number} є простим числом.`);
    } else {
      alert(`Число ${number} НЕ є простим числом.`);
    }
     
     
     
     
     
/*  Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна). 
*/
    
  //  const number = +prompt("введіть будь яке число:");
   // let verif = false;
    
    for (let i = 0; i <= Number(number); i++) {
      if (Math.pow(3, i) === number) {
        verif = true;
        break;
      }
    }
    
    if(verif) {
        console.log(`Задане число ${number} можна одержати шляхом зведення числа 3 у деякий ступінь.`)
    } else {
        console.log(`Задане число ${number} НЕ можна одержати шляхом зведення числа 3 у деякий ступінь.`)
    }
    
    